<?php


return [
    'new' => 'สร้าง',
    'add'  => 'เพิ่ม',
    'edit'  => 'แก้ใข',
    'update' => 'ปรับปรุง',
    'delete' => 'ลบ',
    'copy' => 'คัดลอก',
    'save'  => 'บันทึก',
    'confirm' => 'ยืนยัน',
    'cancel'  => 'ยกเลิก',
    'remove-title' => 'คุณยืนยัน ที่จะลบข้อมูลนี้?',
    'remove-text' => 'เมื่อยืนยัน ไม่สามารถกู้คืนข้อมูลได้',
    'insert-success' => 'เพิ่มข้อมูล เรียบร้อยแล้ว',
    'insert-error' => 'เพิ่มข้อมูล ล้มเหลว!',
    'update-success' => 'ปรับปรุงข้อมูล เรียบร้อยแล้ว',
    'update-error' => 'ปรับปรุงข้อมูล ล้มเหลว!',
    'delete-success' => 'ลบข้อมูล เรียบร้อยแล้ว',
    'delete-error' => 'ลบข้อมูล ล้มเหลว!',
 
];