app/Controllers/Alunodisciplina.php

    public function index($aluno_id)
    {
        // Crie uma instância do modelo 'MedidasAlunosModel'
        $alunodisciplinaModel = new AlunodisciplinaModel();

        // Recupere os registros da tabela 'medidas_alunos' para o aluno_id específico
        $registros = $alunodisciplinaModel->where('aluno_id', $aluno_id)->findAll();
---
SELECT *
FROM `alunodisciplina`
WHERE `aluno_id` = '11400'

    public function atualizar()
    {
        // Obtenha os dados enviados através do Ajax
        $idalunodisciplina = $this->request->getPost('idalunodisciplina');
        $disciplina_id = $this->request->getPost('disciplina_id');
        $alunoId = $this->request->getPost('aluno_id');


        // Valide e processe os dados conforme necessário

        // Crie uma instância do modelo 'AlunodisciplinaModel'
        $alunodisciplinaModel = new AlunodisciplinaModel();

        // Verifique se o registro já existe na tabela
        $registroExistente = $alunodisciplinaModel->find($idalunodisciplina);
---
SELECT *
FROM `alunodisciplina`
WHERE `alunodisciplina`.`id_alunodisciplina` = '0'

                'aluno_id' => $alunoId

            ];
            $alunodisciplinaModel->insert($data);
---
INSERT INTO `alunodisciplina` (`disciplina_id`, `aluno_id`) VALUES ('138', '21327')

    public function delete()
    {
        $disciplina_id = $this->request->getPost('disciplina_id');
        $alunoId = $this->request->getPost('aluno_id');

        // Crie uma instância do modelo 'MedidasAlunosModel'
        $alunodisciplinaModel = new AlunodisciplinaModel();

        // Encontre e remova o registro correspondente pelo alunoId e medidaId
        $alunodisciplinaModel->where('aluno_id', $alunoId)
            ->where('disciplina_id', $disciplina_id)
            ->delete();
---
DELETE FROM `alunodisciplina`
WHERE `aluno_id` = '21327'
AND `disciplina_id` = '138'