app/Controllers/Aluno.php

	public function profilealunoModal($id_aluno)
	{
		$aluno = $this->alunoModel->where('id_aluno' ,$id_aluno)->first();
---
SELECT *
FROM `aluno`
WHERE `id_aluno` = '18645'
 LIMIT 1

	public function EEdetalhes($ee_id) {


		$Encarregado =  $this->enceducacaoModel->where('id_ee' ,$ee_id)->first();
---
SELECT *
FROM `enceducacao`
WHERE `id_ee` = '1272'
 LIMIT 1