app/Controllers/Disciplinas.php

INSERT INTO `disciplina` (`nome`, `horas`, `tipologia_id`) VALUES ('Economia', '250', '1')
---
	public function add()
	{
        $response = array();

		$fields['id_disciplina'] = $this->request->getPost('id_disciplina');
		$fields['nome'] = $this->request->getPost('nome');
		$fields['id_disciplina_e360'] = $this->request->getPost('id_disciplina_e360');
		$fields['horas'] = $this->request->getPost('horas');
		$fields['tipologia_id'] = $this->request->getPost('tipologia_id');


        $this->validation->setRules([
			'nome' => ['label' => 'Nome da disciplina', 'rules' => 'required|min_length[0]|max_length[255]'],
			'id_disciplina_e360' => ['label' => 'ID da disciplina no E360', 'rules' => 'required|min_length[0]|max_length[255]'],
            //'horas' => ['label' => 'Carga horária' ],
            'tipologia_id' => ['label' => 'Tipologia', 'rules' => 'required|min_length[0]|max_length[11]'],

        ]);

        if ($this->validation->run($fields) == FALSE) {

            $response['success'] = false;
			$response['messages'] = $this->validation->getErrors();//Show Error in Input Form

        } else {

            if ($this->disciplinasModel->insert($fields)) {