app/Controllers/LoginController.php

SELECT *
FROM `user`
WHERE `oauth_id` = '109240683608512921467'
 LIMIT 1
---
	public function loginWithGoogle()
	{
		$token = $this->googleClient->fetchAccessTokenWithAuthCode($this->request->getVar('code'));
		if(!isset($token['error'])){
			$this->googleClient->setAccessToken($token['access_token']);
			session()->set("AccessToken", $token['access_token']);

			$googleService = new \Google_Service_Oauth2($this->googleClient);
			$data = $googleService->userinfo->get();
			$currentDateTime = date("Y-m-d H:i:s");
			$email = $data->getEmail();

			// Check if email domain is allowed
			$allowedDomains = array('@aejoaodebarros.pt');
			$domain = substr(strrchr($email, "@"), 1);
			if (!in_array('@' . $domain, $allowedDomains)) {
				session()->setFlashData("Error", "Conta de email não autorizada!");
				return redirect()->to(base_url());
			}else{


			//echo "<pre>"; print_r($data);die;
			$userdata=array();
			if($this->userModel->isAlreadyRegister($data['id'])){
				$result = $this->userModel->where('oauth_id' ,$data['id'])->first();