app/Controllers/MedidasAlunos.php

DELETE FROM `medidas_alunos`
WHERE `aluno_id` = '18645'
AND `medidaDL54_id` = '2'
---
    public function delete()
    {
        $alunoId = $this->request->getPost('alunoId');
        $medidaId = $this->request->getPost('medidaId');

        // Crie uma instância do modelo 'MedidasAlunosModel'
        $medidasAlunosModel = new MedidasAlunosModel();

        // Encontre e remova o registro correspondente pelo alunoId e medidaId
        $medidasAlunosModel->where('aluno_id', $alunoId)
                           ->where('medidaDL54_id', $medidaId)
                           ->delete();