app/Controllers/Tipologia.php

    public function getAlltipologia()
	{
		$result = $this->tipologiaModel->select()->findAll();
---
SELECT *
FROM `tipologia`