app/Controllers/Turmadisciplina.php

	public function turmadetalhes($id_turma)	{
		//$result = $this->turmadisciplinaModel->findAllporTurma($id_turma);
		$resultturma = $this->turmasModel->where('id_turma' ,$id_turma)->first();
---
SELECT *
FROM `turma`
WHERE `id_turma` = '42'
 LIMIT 1

	public function add()
	{
		// Obtenha os dados do formulário
		$turma_id = $this->request->getPost('turma_id');
		$disciplina_ids = $this->request->getPost('duallistbox');
		$carga_horaria = $this->request->getPost('carga_horaria');
		$response['disciplinas vindas da view'] = $this->request->getPost('duallistbox'); //tirar
		$response['disciplina_id'] = $this->request->getPost('duallistbox');; //tirar
		// Obtenha as disciplinas existentes na tabela turmadisciplina para a turma em questão
		$turmaDisciplinas = $this->turmadisciplinaModel->where('turma_id', $turma_id)->findAll();
---
SELECT *
FROM `turmadisciplina`
WHERE `turma_id` = '73'

			// Para cada disciplina selecionada, insira ou atualize a linha na tabela turmadisciplina
			foreach ($disciplina_ids as $disciplina_id) {
				// Verifique se a linha já existe na tabela turmadisciplina
					$turmaDisciplina = $this->turmadisciplinaModel->where('turma_id', $turma_id)
					->where('disciplina_id', $disciplina_id)
					->first();
---
SELECT *
FROM `turmadisciplina`
WHERE `turma_id` = '73'
AND `disciplina_id` = '36'
 LIMIT 1

				if ($turmaDisciplina) {
					// Se a linha existir, atualize a carga horária
					$response['já existe  este update'] = $disciplina_id; //tirar
					$this->turmadisciplinaModel->update($turmaDisciplina->turma_id, ['carga_horaria' => $carga_horaria]);
				} else {
					// Caso contrário, insira uma nova linha na tabela turmadisciplina
					$response['insere este'] = $disciplina_id; //tirar
					$this->turmadisciplinaModel->insert(['turma_id' => $turma_id, 'disciplina_id' => $disciplina_id, 'carga_horaria' => $carga_horaria]);
---
UPDATE `turmadisciplina` SET `carga_horaria` = NULL
WHERE `turmadisciplina`.`id_turmadisciplina` IN ('73')
INSERT INTO `turmadisciplina` (`turma_id`, `disciplina_id`, `carga_horaria`) VALUES ('73', '36', NULL)