app/Controllers/User.php

	public function getAllArrayNomes(){
		$response = $data['data'] = array();

		$data = $this->userModel->select()->getAllNome();
---
SELECT *
FROM `user`