app/Models/AnoletivoModel.php

SELECT *, `id_anoletivo`, `anoletivo`, `status`
FROM `ano_letivo`
ORDER BY `anoletivo` ASC
---
	public function getAllAL()
    {
        return $this->select('id_anoletivo, anoletivo,status')->orderBy('anoletivo', 'ASC')->findAll();//get();