app/Models/DisciplinasModel.php

	public function getDisciplinascomtipologias()
    {
        $db = \Config\Database::connect();

        $query = $db->table('disciplina')
            ->select('disciplina.*,tipologia.nome_tipologia ')
			->join('tipologia','tipologia.id_tipologia=disciplina.tipologia_id' )
            ->get();
---
SELECT `disciplina`.*, `tipologia`.`nome_tipologia`
FROM `disciplina`
JOIN `tipologia` ON `tipologia`.`id_tipologia`=`disciplina`.`tipologia_id`