app/Models/TurmadisciplinaModel.php

SELECT `turmadisciplina`.*, `turma`.`ano`, `turma`.`nome`, `user`.`name`
FROM `turmadisciplina`
JOIN `turma` ON `turmadisciplina`.`turma_id`=`turma`.`id_turma`
JOIN `user` ON `user`.`id`= `user_id`
WHERE `turma_id` = '41'
SELECT `turmadisciplina`.*, `turma`.`nome` AS `nometurma`, `user`.`name` AS `nomeprof`, `disciplina`.`nome` AS `nomedisc`, `disciplina`.`id_disciplina` AS `id_disciplina`
FROM `turmadisciplina`
JOIN `turma` ON `turmadisciplina`.`turma_id` = `turma`.`id_turma`
LEFT JOIN `user` ON `turmadisciplina`.`user_id` = `user`.`id_360`
JOIN `disciplina` ON `turmadisciplina`.`disciplina_id` = `disciplina`.`id_disciplina`
WHERE `turma_id` = '495'
---
	public function findAllporTurma($id_turma)
	{
    $db = \Config\Database::connect();

    $query = $db->table('turmadisciplina')
        ->select('turmadisciplina.*, turma.nome AS nometurma, user.name AS nomeprof')
        ->join('turma', 'turmadisciplina.turma_id = turma.id_turma')
        ->join('user', 'turmadisciplina.user_id = user.id', 'left') //left tambem faz aparecer os NULLs
        ->where('turma_id', $id_turma)
        ->get();

    return $query->getResult();