app/Models/TurmasModel.php

SELECT `turma`.*, `ano_letivo`.`anoletivo`, `tipologia`.`nome_tipologia`, `ano_letivo`.`status`
FROM `turma`
JOIN `tipologia` ON `tipologia`.`id_tipologia`=`turma`.`tipologia_id`
JOIN `ano_letivo` ON `ano_letivo`.`id_anoletivo` = `turma`.`anoletivo_id`
WHERE `ano_letivo`.`status` = 1
AND `tipologia_id` = 1
ORDER BY `nome` ASC
SELECT `turma`.*, `ano_letivo`.`anoletivo`, `tipologia`.`nome_tipologia`
FROM `turma`
JOIN `tipologia` ON `tipologia`.`id_tipologia`=`turma`.`tipologia_id`
JOIN `ano_letivo` ON `ano_letivo`.`id_anoletivo` = `turma`.`anoletivo_id`
WHERE `anoletivo_id` = 1
AND `tipologia_id` = 1
ORDER BY `nome` ASC
---
	public function getTurmasregular()
    {
        $db = \Config\Database::connect();

        $query = $db->table('turma')
		->select('turma.*, ano_letivo.anoletivo,tipologia.nome_tipologia,ano_letivo.status ')
		->join('tipologia','tipologia.id_tipologia=turma.tipologia_id' )
		->join('ano_letivo', 'ano_letivo.id_anoletivo = turma.anoletivo_id')
		->where('ano_letivo.status',1)
		->where('tipologia_id',1)
			->orderby('nome','ASC')
            ->get();

        return $query->getResult();