app/Models/UserModel.php

SELECT *
FROM `user`
WHERE `oauth_id` = '109240683608512921467'
---
	function isAlreadyRegister($authid){
		return $this->db->table('user')->getWhere(['oauth_id'=>$authid])->getRowArray()>0?true:false;

UPDATE `user` SET `name` = 'António Neto', `email` = 'antonioneto@aejoaodebarros.pt', `profile_img` = 'https://lh3.googleusercontent.com/a/AGNmyxYH3tprhmjB1VL1A6niFPX5q4IqEmiU3_cZ064=s96-c', `updated_at` = '2023-03-14 19:20:25', `level` = '1', `status` = NULL
WHERE `oauth_id` = '109240683608512921467'
---
	function updateUserData($userdata, $authid){
		$this->db->table("user")->where(['oauth_id'=>$authid])->update($userdata);